export default
`公元2019年，微信公众号排版能力孱弱，始终为运营者所诟病，秀米、135编辑器等工具割据一方。

但无论是微信原生工具，还是其他编辑器，都让创作者不得不将有限的创作经历分散到排版设计上。

> Markdown——解决排版的灵丹妙药，应运而生。

## Markdown是什么？

Markdown 是一种排版语法，拥有极简的输入方式和极低的学习成本。


富含了标题、引用、加粗、链接、图片、代码段、公式等一切在文字创作中需要的排版格式。

> 拥有它，让人专注于内容本身，而不被格式所打扰。

## 怎么和微信公众号结合？

这么优秀的排版语法，可是微信公众号也不支持呀。

> **别急！Markdown Nice来帮你解决问题！**

## Markdown Nice是什么？

一款开源 Markdown 编辑器，写完后即排版成功，复制即可粘贴到微信公众号。

**So what？ 只有这点么？**

**当然不是！Nice宝宝你还有什么特性呀？** 

🤗：

- 支持零配置图床[^1]、脚注、代码、公式
- 支持自定义样式
- 内容在浏览器中实时保存
- 可提交主题供人瞻仰
- **我颜值高呀**

![左边编辑器](https://i.loli.net/2019/04/01/5ca1b0465f4ea.png)

![右边预览区域](https://i.loli.net/2019/04/01/5ca1b048ad7d8.png)


这么多优秀的特性摆在你面前，还在等什么？

地址：\`https://www.mdnice.com\`

**快让你的微信排版 Nice 起来！**

## 软件理念

~~没想到你还在看~~

咳咳、、、

**大多数人而言，内容重于排版，排版重于设计。**

内容是吸引读者的核心，所以最重要。

而排版与设计之间的比较，作为一个曾经的微信美术编辑，随着排版经验的增多，发现文章的效果并不在于额外的花边、点缀。

> **整齐、舒服、简单是硬道理!**

🤗：**我颜值高呀**

## 内容、排版与设计

**设计 = 排版 + 创意**
 
---

因为：大多数人不会获取创意，或认为创意成本过高。

所以：大多数人不做设计，富文本设计不适合单纯的内容编辑者。

---

虽然：大多数人也不会排版，或认为排版成本过高。

但是：**Markdown Nice 将用户从排版中释放出来，只关注内容本身。**

## 未来

我们的工具将在合适的场景，坚持我们的软件理念。

除了微信公众号，简历、PPT 都是小 Nice 的工作重点，Markdown Resume[^2]
正在孕育之中。

欢迎点击**阅读全文**在PC端使用 Markdown Nice，感受排版新体验。

🤗：**我颜值高呀**

<br/>

<img style="width: 100%" src="https://i.loli.net/2019/04/01/5ca1a3eda5a7d.jpg" />

---

[^1]: 使用SM.MS图床

    https://sm.ms/

[^2]: 一款 Markdown 语法排版简历的工具

    https://github.com/guanpengchn/markdown-resume`
